/****************************************************************************************************
* @函数名称:	WriteData
* @功  能：		将数据写入加密狗
* @参  数：		无
* @返回值：		S_OK 操作成功,否则 返回对应的错误代码
* @说  明：		获取基本信息--->加密数据--->写狗
****************************************************************************************************/
HRESULT CHikDog::WriteData()
{
	if( S_OK != SetHikInfo() )								//顺序1
	{		
		//WriteLog("海康狗-设置基本信息失败");
		return S_FALSE;
	}

	if( S_OK != Encrypt() )									//顺序2
	{
		//WriteLog("海康狗-加密数据失败");
		return S_FALSE;
	}

	if( S_OK != CDog::WriteData() )						//顺序3
	{
		//WriteLog("海康狗-写数据失败");
		return  S_FALSE;
	}
	return  S_OK;
}